veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxEvadc_reg.h
/** \brief 2F2C, Group 10 Result Register 11\n */
#define EVADC_G10_RES11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022F2Cu)
/** Alias (User Manual Name) for EVADC_G10_RES11.
* To use register names with standard convension, please use EVADC_G10_RES11.
*/
#define EVADC_G10RES11 (EVADC_G10_RES11)

/** \brief 2F30, Group 10 Result Register 12\n */
#define EVADC_G10_RES12 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022F30u)
/** Alias (User Manual Name) for EVADC_G10_RES12.
* To use register names with standard convension, please use EVADC_G10_RES12.
*/
#define EVADC_G10RES12 (EVADC_G10_RES12)

/** \brief 2F34, Group 10 Result Register 13\n */
#define EVADC_G10_RES13 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022F34u)
/** Alias (User Manual Name) for EVADC_G10_RES13.
* To use register names with standard convension, please use EVADC_G10_RES13.
*/
#define EVADC_G10RES13 (EVADC_G10_RES13)

/** \brief 2F38, Group 10 Result Register 14\n */
#define EVADC_G10_RES14 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022F38u)
/** Alias (User Manual Name) for EVADC_G10_RES14.
* To use register names with standard convension, please use EVADC_G10_RES14.
*/
#define EVADC_G10RES14 (EVADC_G10_RES14)

/** \brief 2F3C, Group 10 Result Register 15\n */
#define EVADC_G10_RES15 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022F3Cu)
/** Alias (User Manual Name) for EVADC_G10_RES15.
* To use register names with standard convension, please use EVADC_G10_RES15.
*/
#define EVADC_G10RES15 (EVADC_G10_RES15)

/** \brief 2F80, Group 10 Result Reg. 0, Debug */
#define EVADC_G10_RESD0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022F80u)
/** Alias (User Manual Name) for EVADC_G10_RESD0.
* To use register names with standard convension, please use EVADC_G10_RESD0.
*/
#define EVADC_G10RESD0 (EVADC_G10_RESD0)

/** \brief 2F84, Group 10 Result Reg. 1, Debug */
#define EVADC_G10_RESD1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022F84u)
/** Alias (User Manual Name) for EVADC_G10_RESD1.
* To use register names with standard convension, please use EVADC_G10_RESD1.
*/
#define EVADC_G10RESD1 (EVADC_G10_RESD1)

/** \brief 2F88, Group 10 Result Reg. 2, Debug */
#define EVADC_G10_RESD2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022F88u)
/** Alias (User Manual Name) for EVADC_G10_RESD2.
* To use register names with standard convension, please use EVADC_G10_RESD2.
*/
#define EVADC_G10RESD2 (EVADC_G10_RESD2)

/** \brief 2F8C, Group 10 Result Reg. 3, Debug */
#define EVADC_G10_RESD3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022F8Cu)
/** Alias (User Manual Name) for EVADC_G10_RESD3.
* To use register names with standard convension, please use EVADC_G10_RESD3.
*/
#define EVADC_G10RESD3 (EVADC_G10_RESD3)

/** \brief 2F90, Group 10 Result Reg. 4, Debug */
#define EVADC_G10_RESD4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022F90u)
/** Alias (User Manual Name) for EVADC_G10_RESD4.
* To use register names with standard convension, please use EVADC_G10_RESD4.
*/
#define EVADC_G10RESD4 (EVADC_G10_RESD4)

/** \brief 2F94, Group 10 Result Reg. 5, Debug */
#define EVADC_G10_RESD5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022F94u)
/** Alias (User Manual Name) for EVADC_G10_RESD5.
* To use register names with standard convension, please use EVADC_G10_RESD5.
*/
#define EVADC_G10RESD5 (EVADC_G10_RESD5)

/** \brief 2F98, Group 10 Result Reg. 6, Debug */
#define EVADC_G10_RESD6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022F98u)
/** Alias (User Manual Name) for EVADC_G10_RESD6.
* To use register names with standard convension, please use EVADC_G10_RESD6.
*/
#define EVADC_G10RESD6 (EVADC_G10_RESD6)

/** \brief 2F9C, Group 10 Result Reg. 7, Debug */
#define EVADC_G10_RESD7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022F9Cu)
/** Alias (User Manual Name) for EVADC_G10_RESD7.
* To use register names with standard convension, please use EVADC_G10_RESD7.
*/
#define EVADC_G10RESD7 (EVADC_G10_RESD7)

/** \brief 2FA0, Group 10 Result Reg. 8, Debug */
#define EVADC_G10_RESD8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022FA0u)
/** Alias (User Manual Name) for EVADC_G10_RESD8.
* To use register names with standard convension, please use EVADC_G10_RESD8.
*/
#define EVADC_G10RESD8 (EVADC_G10_RESD8)

/** \brief 2FA4, Group 10 Result Reg. 9, Debug */
#define EVADC_G10_RESD9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022FA4u)
/** Alias (User Manual Name) for EVADC_G10_RESD9.
* To use register names with standard convension, please use EVADC_G10_RESD9.
*/
#define EVADC_G10RESD9 (EVADC_G10_RESD9)

/** \brief 2FA8, Group 10 Result Reg. 10, Debug */
#define EVADC_G10_RESD10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022FA8u)
/** Alias (User Manual Name) for EVADC_G10_RESD10.
* To use register names with standard convension, please use EVADC_G10_RESD10.
*/
#define EVADC_G10RESD10 (EVADC_G10_RESD10)

/** \brief 2FAC, Group 10 Result Reg. 11, Debug */
#define EVADC_G10_RESD11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022FACu)
/** Alias (User Manual Name) for EVADC_G10_RESD11.
* To use register names with standard convension, please use EVADC_G10_RESD11.
*/
#define EVADC_G10RESD11 (EVADC_G10_RESD11)

/** \brief 2FB0, Group 10 Result Reg. 12, Debug */
#define EVADC_G10_RESD12 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022FB0u)
/** Alias (User Manual Name) for EVADC_G10_RESD12.
* To use register names with standard convension, please use EVADC_G10_RESD12.
*/
#define EVADC_G10RESD12 (EVADC_G10_RESD12)

/** \brief 2FB4, Group 10 Result Reg. 13, Debug */
#define EVADC_G10_RESD13 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022FB4u)
/** Alias (User Manual Name) for EVADC_G10_RESD13.
* To use register names with standard convension, please use EVADC_G10_RESD13.
*/
#define EVADC_G10RESD13 (EVADC_G10_RESD13)

/** \brief 2FB8, Group 10 Result Reg. 14, Debug */
#define EVADC_G10_RESD14 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022FB8u)
/** Alias (User Manual Name) for EVADC_G10_RESD14.
* To use register names with standard convension, please use EVADC_G10_RESD14.
*/
#define EVADC_G10RESD14 (EVADC_G10_RESD14)

/** \brief 2FBC, Group 10 Result Reg. 15, Debug */
#define EVADC_G10_RESD15 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022FBCu)
/** Alias (User Manual Name) for EVADC_G10_RESD15.
* To use register names with standard convension, please use EVADC_G10_RESD15.
*/
#define EVADC_G10RESD15 (EVADC_G10_RESD15)

